package com.javaex.practice;

public class Ex06 {
		/*
 		아래의 설명중 틀린 것을 찾아서 수정해 보세요.
		(1) 변수한개에는 동시에 여러 개의 값을 담을 수 있다.
		 ㄴ 변수 한 개에는 한 가지의 값만 담을 수 있음
		(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
		(3) 변수는 초기값이 저장되지 않아도 읽을 수 있다.
		 ㄴ 초기값이 없으면 읽을 수 없다
		(4) 모든 자료형의 변수는 동일한 방식으로 저장된다.
		 ㄴ 자료형에 따라 달라짐 
		(5) double형은 flaot보다 큰 수를 담을 수 있다.
		(6) int, float, char, String은 모두 기본자료형에 속한다
		 ㄴ String은 기본 자료형에 속하지 않음
		(7) final로 선언된 변수는 수정이 가능하다
		 ㄴ final로 선언된 변수는 수정 불가능
		(8) long형은 항상 L을 붙여서 대입해야한다.
		 ㄴ int 범위 안에 속하지 않는 부분은 붙여야 함
		(9) float형은 항상 F을 분여서 대입해야한다.
		 ㄴ 반드시 붙일 필요는 없음

		 */
}
